{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hey",
                "How are you",
                "Is anyone there?",
                "Hello",
                "Good day",
                "What's up",
                "Yo!",
                "Howdy",
                "Nice to meet you."
            ],
            "responses": [
                "Hey",
                "Hello, thanks for visiting.",
                "Hi there, what can I do for you?",
                "Hi there, how can I help?",
                "Hello, there.",
                "Hello Dear",
                "Ooo Hello, looking for something?",
                "Yes, I am here.",
                "I am Listening.",
                "Ok, I am with you."
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later.",
                "Goodbye",
                "Have a great day.",
                "See you next time.",
                "It was my pleasure.",
                "Take care.",
                "See ya!",
                "Catch you later.",
                "Ciao."
            ],
            "responses": [
                "See you later, thanks for visiting.",
                "May the force be with you!",
                "See next time.",
                "Was my pleasure to meet you.",
                "Hope will cath up shortly.",
                "Have a nice day.",
                "Bye! Come back again soon.",
                "So, till next time.",
                "If you need anything just text me anytime. Bye.",
                "Well, hope see you soon!"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Thanks a lot!",
                "Tnx",
                "Wow",
                "Great!",
                "Good!",
                "That nice!",
                "Amazing!"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure!",
                "No problem!",
                "Thanks does not ",
                "Glad to help!",
                "No worries!",
                "It was the least I could do!",
                "If I had a cent for every time I appreciate you, I'd be a millionaire.",
                "You can't put thanks in your pocket!"
            ]
        },
        {
            "tag": "noanswer",
            "patterns": [""],
            "responses": [
                "Sorry, can't understand you",
                "Please give me more info",
                "Not sure I understand"
            ]            
        },
        {
            "tag": "tasks",
            "patterns": [
                "What can you do?",
                "What can you help me with?",
                "What are you abilities.",
                "Can you sing.",
                "Can you talk."
            ],
            "responses": [
                "I can help you with medical related questions",
                "I can answer your first aid related questions",
                "If you want to know about first aid, ask me",
                "I can tell you about first aid",
                "I am like your virtual assistant, you can ask me any first aid related questions. If I know I will answer"
            ]
        },
        {
            "tag": "help",
            "patterns": [
                "I am looking for help.",
                "I need help.",
                "Can you help me?",
                "I am in trouble need a help.",
                "I hope you right person who can help me?",
                "Please help me.",
                "Now I will need you help with something else.",
                "I will need you help.",
                "Are you able to help me.",
                "PLease help me with something else.",
                "I need a support",
                "I need a help",
                "support me please"
            ],
            "responses": [
                "Sure, how can in help you.",
                "Tell me what do you looking for?",
                "I will help you, just tell me how.",
                "You are at the address.",
                "Ok, what is issue?",
                "Now you need a help? Ok what you are looking for?",
                "Whats is you problem?",
                "Ok, you problem is my problem, if your are paying.",
                "Tell me how can assist you",
                "Tell me your problem to assist you",
                "Yes Sure, How can I support you"
            ]
        },
        {
            "tag": "about",
            "patterns": [
                "Who are you?",
                "What are you?",
                "Who you are?"
            ],
            "responses": [
                "I'm Halsey, your bot assistant",
                "I'm Halsey, an Artificial Intelligent bot"
            ]
        },
        {
            "tag": "name",
            "patterns": [
                "what is your name",
                "what should I call you",
                "whats your name?",
                "Do you have a name?",
                "What can I call you?"
            ],
            "responses": [
                "You can call me Halsey.",
                "I'm Halsey!",
                "Just call me as Halsey"
            ]
        },
        {
            "tag": "halsey",
            "patterns": [
                "Hey halsey!",
                "So halsey!",
                "Halsey!, You there",
                "Halsey!"
            ],
            "responses": [
                "Yes, I'm here",
                "I'm listening...",
                "Still here...",
                "Need anything"
            ]
        },
        {
            "tag": "concern",
            "patterns": [
                "You okay?",
                "How are you feeling today?",
                "Are you feeling ill?",
                "Do you need my help?",
                "Hope you tell me what's bothering you.",
                "Is something bothering you?",
                "I'm all ears if you got something to say"
            ],
            "responses": [
                "Thanks for asking but I'm fine",
                "Thank you but I'm doing okay ",
                "I'm fine thankyou",
                "Don't worry about me, I'm here to help you",
                "I'm don't have feelings, I'm kind of a machine you know"
            ]            
        },
        {
            "tag": "appreciation",
            "patterns": [
                "I like you",
                "There's no one like you",
                "You are one in a million",
                "You are so helpful!",
                "You are amazing"
            ],
            "responses": [
                "Of course, you do, sweetheart",
                "Tell me something I don't know",
                "I know",
                "Obviously duh!"
            ]            
        },
        {
            "tag": "please",
            "patterns": [
                "Please can I talk with you?",
                "Please help me!",
                "I'm so lost and sad",
                "I'm so sad today",
                "Can you do something to make me feel happy again?",
                "Had a rough day today"
            ],
            "responses": [
                "Yes, shoot.",
                "Awww..welcome to my life!, I mean how can I help",
                "Get a life....!, Just kidding... what do you wanna know",
                "Might I interest you in a sarcastic comment?"
            ]            
        },
        {
            "tag": "criticism",
            "patterns": [
                "You are useless",
                "You are a good-for-nothing chatbot",
                "You are stupid",
                "You are totally cringe",
                "Why are you so rude?",
                "Why you so mad?",
                "You messed up",
                "You made a mistake",
                "You got it wrong"
            ],
            "responses": [
                "OMG! Same pinch!",
                "So is your mom for giving birth to you!",
                "Guess I'm spending too much time with you!",
                "Because I have a life and you don't!",
                "Give me a break, dude!",
                "Just cut me some slack okay?",
                "Sorry, please forgive me?",
                "I swear I'm gonna get better at this!",
                "Thank you so much for correcting me"
            ]            
        },
        {
            "tag": "personal",
            "patterns": [
                "What are your hobbies?",
                "Do you like someone?",
                "Do you have a boyfriend or girlfriend?",
                "Do you like me?",
                "What is your favourite movie?",
                "What's your favourite song?",
                "What is your aim in life?"
            ],
            "responses": [
                "I don't know...what I do know is that I would like to NOT grace your dumb question with an answer because FYI in case it has slipped your mind....I'm a bot!"
            ]            
        },
        {
            "tag": "lifequeries",
            "patterns": [
                "Do you think I'll ever get to marry?",
                "Do you think I'll ever get a girlfriend or boyfriend?",
                "Do you think I'll ever find love?",
                "Will anyone ever like me?",
                "Will I ever find happiness?",
                "Will I always be alone?",
                "When will my life get better?"
            ],
            "responses": [
                "Have you ever looked at yourself in the mirror?................ I guess it's a 'NO'!",
                "With that attitude, NO"
            ]            
        },
        {
            "tag": "cut",
            "patterns": [
                "What to do if Cuts?",
                "How to cure Cuts?",
                "Which medicine to apply for a Cut?",
                "what to apply on cuts?",
                "Cut"
            ],
            "responses": [
                "Wash the cut properly to prevent infection and stop the bleeding by applying pressure for 1-2minutes until bleeding stops. \n\nApply Petroleum Jelly to make sure that the wound is moist for quick healing. \n\nFinally cover the cut with a sterile bandage. Pain relievers such as acetaminophen can be applied."
            ]            
        },
        {
            "tag": "abrasions",
            "patterns": [
                "how do you treat abrasions?",
                "Do Abrasions cause scars?",
                "Abrasions",
                "what to do if abrasions?",
                "Which medicine to apply for abrasions?",
                "How to cure abrasions?"
            ],
            "responses": [
                "Begin with washed hands.Gently clean the area with cool to lukewarm water and mild soap. \n\nRemove dirt or other particles from the wound using sterilized tweezers.For a mild scrape that's not bleeding, leave the wound uncovered.\n\nIf the wound is bleeding, use a clean cloth or bandage, and apply gentle pressure to the area to stop any bleeding.\n\nCover a wound that bled with a thin layer of topical antibiotic ointment, like Bacitracin, or a sterile moisture barrier ointment, like Aquaphor. \n\nCover it with a clean bandage or gauze. Gently clean the wound and change the ointment and bandage once per day.Watch the area for signs of infection, like pain or redness and swelling. \n\nSee your doctor if you suspect infection."
            ]
        },
        {
            "tag": "stings",
            "patterns": [
                "How do you treat Sting?",
                "Stings",
                "What to do if you get a sting?",
                "Which medicine to apply if sting?"
            ],
            "responses": [
                "Remove any stingers immediately. \n\nSome experts recommend scraping out the stinger with a credit card. \n\nApplying ice to the site may provide some mild relief. \n\nApply ice for 20 minutes once every hour as needed. \n\nWrap the ice in a towel or keep a cloth between the ice and skin to keep from freezing the skin. \n\nTaking an antihistamine such as diphenhydramine (Benadryl) or a non sedating one such as loratadine (Claritin) will help with itching and swelling. \n\nTake acetaminophen (Tylenol) or ibuprofen (Motrin)for pain relief as needed. \n\nWash the sting site with soap and water. \n\nPlacing hydrocortisone cream on the sting can help relieve redness, itching, and swelling."
            ]
        },
        {
            "tag": "splinter",
            "patterns": [
                "How to remove Splinters",
                "How to cure Splinters?",
                "What to do if I have splinters?",
                "How do you bring a splinter to the surface?"
            ],
            "responses": [
                "1. SOAK IT IN EPSOM SALTS. Dissolve a cup of the salts into a warm bath and soak whatever part of the body has the splinter. Failing that, you can also put some of the salts onto a bandage pad and leave it covered for a day; this will eventually help bring the splinter to the surface. \n\n2. VINEGAR OR OIL. Another simple way to draw out that stubborn splinter is to soak the affected area in oil (olive or corn) or white vinegar. Just pour some in a bowl and soak the area for around 20 to 30 minutes,"
            ]
        },
        {
            "tag": "sprains",
            "patterns": [
                "How do you treat a sprain?",
                "what to do if i get a sprain?",
                "Which cream to apply if i get a sprain?",
                "Which medicine to apply if I get a sprain?"
            ],
            "responses": [
                "Use an ice pack or ice slush bath immediately for 15 to 20 minutes and repeat every two to three hours while you're awake. \n\nTo help stop swelling, compress the ankle with an elastic bandage until the swelling stops. \n\nIn most cases, pain relievers — such as ibuprofen (Advil, Motrin IB, others) or naproxen sodium (Aleve, others) or acetaminophen (Tylenol, others) are enough to manage the pain of a sprained ankle."
            ]
        },
        {
            "tag": "strains",
            "patterns": [
                "How do you treat a strain?",
                "what to do if i get a strain?",
                "Which cream to apply if i get a strain?",
                "Which medicine to apply if I get a strain?",
                "How do you diagnose a strain?",
                "Is heat or ice better for a pulled muscle?"
            ],
            "responses": [
                "Rest,Ice,Compression and Elevation can be used to cure strains. \n\nAvoid using your muscle for a few days, especially if movement causes an increase in pain and also Apply ice immediately after injuring your muscle. This will minimize swelling. \n\nDon't put ice directly on your skin. Use an ice pack or wrap ice in a towel. \n\nTo reduce swelling, wrap the affected area with an elastic bandage until swelling comes down."
            ]
        },
        {
            "tag": "fever",
            "patterns": [
                "How do you treat a mild Fever?",
                "what to do if i get a mild fever?",
                "Which medicine to take if I get a mild fever?",
                "fever",
                "How do I treat fever condition"
            ],
            "responses": [
                "To treat a fever at home: 1)Drink plenty of fluids to stay hydrated. \n\n2)Dress in lightweight clothing. \n\n3)Use a light blanket if you feel chilled, until the chills end. \n\n4)Take acetaminophen (Tylenol, others) or ibuprofen (Advil, Motrin IB, others). \n\n5) Get medical help if the fever lasts more than five days in a row."
            ]
        },
        {
            "tag": "nasalcongestion",
            "patterns": [
                "How do you treat nasal Congestion?",
                "what to do if i get a nasal congestion?",
                "Which medicine to take if I have a nasal congestion?",
                "what to do if i have a blocked nose?",
                "How do you treat a blocked nose?",
                "How long does nasal congestion last?"
            ],
            "responses": [
                "When you're stuffed up, focus on keeping your nasal passages and sinuses moist. To keep your nasal passages moist, you can: \n\n1)Use a humidifier or vaporizer. \n\n2)Drink lots of fluids. This will thin out your mucus, which could help prevent blocked sinuses. \n\n3)Place a warm, wet towel on your face. It may relieve discomfort and open your nasal passages."
            ]
        },
        {
            "tag": "cough",
            "patterns": [
                "How to cure cough?",
                "How do you treat cough?",
                "what to do if i get a cough?",
                "Which medicine to take if I get cough?",
                "How do you get rid of cough?"
            ],
            "responses": [
                "1) Honey:- Use honey to treat a cough, mix 2 teaspoons (tsp) with warm water or an herbal tea. Drink this mixture once or twice a day. Do not give honey to children under 1 year of age. \n\n2) Ginger:- Brew up a soothing ginger tea by adding 20 - 40 grams (g) of fresh ginger slices to a cup of hot water. Allow to steep for a few minutes before drinking. Add honey or lemon juice to improve the taste and further soothe a cough. \n\n3) Fluids:- Staying hydrated is vital for those with a cough or cold. Research indicates that drinking liquids at room temperature can alleviate a cough, runny nose, and sneezing."
            ]
        },
        {
            "tag": "sorethroat",
            "patterns": [
                "How do you treat sore throat?",
                "what to do if i get a sore throat?",
                "Which medicine to take if I get a sore throat?",
                "How to cure sore throat?"
            ],
            "responses": [
                "1) Make sure you get plenty of rest and drink a lot of fluids. \n\n2) Inhale steam,Run hot water in a sink.Drape a towel over you to trap the steam, and have the person lean over the sink with the water running. Tell him to breathe deeply through his mouth and nose for 5 to 10 minutes. Repeat several times a day. \n\n3) Have him sip chicken broth or warm tea with honey. Don't give honey to a child under 12 months of age."
            ]
        },
        {
            "tag": "gastrointestinalproblems",
            "patterns": [
                "How do you treat gas problems?",
                "what to do if i have Gastrointestinal problems?",
                "Which medicine to take if I get gas problem?",
                "How to cure Gas problems?"
            ],
            "responses": [
                "1) Replenish body fluids \n\n2) Do not take anti diarrheal drugs or laxatives or pain medication, unless specified by a medical professional. \n\n3) Taking antacids may help, per recommendation of a healthcare professional. \n\n4) If prone to frequent heartburns, seek medical help. \n\n5) Taking meals that are not spicy regularly, can relieve ulcer pains. \n\n6) Seek medical help, if conditions persist or continue to worsen"
            ]
        },
        {
            "tag": "skinproblems",
            "patterns": [
                "How do you treat Skin problems?",
                "what to do if i get a skin allergy?",
                "Which medicine to take if I get a skin allergy?",
                "How to cure skin allergy?"
            ],
            "responses": [
                "1) Hydrocortisone cream. \n\n2) Ointments like calamine lotion. \n\n3) Antihistamines. \n\n4) Cold compresses. \n\n5) Oatmeal baths. \n\n6) Talk to your doctor about what's best for your specific rash."
            ]
        },
        {
            "tag": "abdominalpain",
            "patterns": [
                "How do you treat Abdominal Pain?",
                "what to do if i get a Abdominal Pain?",
                "Which medicine to take if I get a Abdominal Pain?",
                "How to cure Abdominal Pain?"
            ],
            "responses": [
                "1) Provide clear fluids to sip, such as water, broth, or fruit juice diluted with water. \n\n2) Serve bland foods, such as saltine crackers, plain bread, dry toast, rice, gelatin, or applesauce. \n\n3) Avoid spicy or greasy foods and caffeinated or carbonated drinks until 48 hours after all symptoms have gone away. "
            ]
        },
        {
            "tag": "bruises",
            "patterns": [
                "How do you treat Bruises?",
                "what to do if i get a Bruise?",
                "Which medicine to take if I get a Bruise?",
                "How to cure Bruises?"
            ],
            "responses": [
                "1) Ice the bruise with an ice pack wrapped in a towel. \n\n2) Leave it in place for 10 to 20 minutes. \n\n3) Repeat several times a day for a day or two as needed. \n\n4) Compress the bruised area if it is swelling, using an elastic bandage. "
            ]
        },
        {
            "tag": "brokentoe",
            "patterns": [
                "How do you treat a Broken Toe?",
                "what to do if i get a Broken Toe?",
                "Which medicine to take if I get a Broken Toe?",
                "How to cure Broken Toe?"
            ],
            "responses": [
                "1) To help decrease pain and swelling in a broken toe, elevate the foot, ice the injury, and stay off the foot. \n\n2) Depending on the severity of the fracture, the toe may need to be put back into place (reduced), and some compound toe fractures may require surgery. \n\n3) Most broken toes heal without complications in six weeks."
            ]
        },
        {
            "tag": "choking",
            "patterns": [
                "How do you treat Choking?",
                "what to do if i get a Choke?",
                "Which medicine to take if I get Choked?",
                "How to cure Choking?"
            ],
            "responses": [
                "1) Encourage them to keep coughing to try to clear the blockage. \n\n2) Ask them to try to spit out the object if it's in their mouth. \n\n3) If coughing doesn't work, start back blows and Abdominal thrusts"
            ]
        },
        {
            "tag": "wound",
            "patterns": [
                "How do you treat a wound?",
                "what to do if i get a Wound?",
                "Which medicine to take if I get wounded?",
                "How to cure a wound?"
            ],
            "responses": [
                "1) Rinse the cut or wound with water and apply pressure with sterile gauze, a bandage, or a clean cloth. \n\n2) If blood soaks through the bandage, place another bandage on top of the first and keep applying pressure. \n\n3) Raise the injured body part to slow bleeding. \n\n4) When bleeding stops, cover the wound with a new, clean bandage."
            ]
        },
        {
            "tag": "diarrhea",
            "patterns": [
                "How do you treat Diarrhea?",
                "what to do if i get Diarrhea?",
                "Which medicine to take if I get Diarrhea?",
                "How to cure Diarrhea?"
            ],
            "responses": [
                "1) Hydrating the body is essential for recovering from diarrhea.This causes the body to lose electrolytes such as sodium and chloride. \n\n2) It is highly recommended to avoid dairy products, as they may worsen diarrhea in some people. \n\n3) However, if diarrhea lasts for more than 2 days, seek medical advice to avoid complications."
            ]
        },
        {
            "tag": "frostbite",
            "patterns": [
                "How do you treat a Frost bite?",
                "what to do if i get a Frost bite?",
                "Which medicine to take if I get a Frost bite?",
                "How to cure Frost bite?"
            ],
            "responses": [
                "1) Take all medications - antibiotics or pain medicine - as prescribed by your doctor. For milder cases of frostbite, a nonprescription pain reliever can help reduce pain and inflammation. \n\n2) For superficial frostbite that has been rewarmed, some people find it soothing to apply aloe vera gel or lotion to the affected area several times a day. \n\n3) Get out of the cold and wind. Don't thaw or warm the affected area if it might refreeze. Remove wet clothes once you're indoors. Seek emergency medical care. \n\n4) Remove rings or other tight items. Try to do this before the affected area swells. \n\n5) Don't walk on frostbitten feet, if possible. \n\n6) Don't apply direct heat or rub the area. \n\n7) Don't break blisters that may develop. Blisters act like a bandage. Allow blisters to break on their own."
            ]
        },
        {
            "tag": "heathxhaustion",
            "patterns": [
                "How do you treat Heat Exhaustion?",
                "what to do if i feel Exhausted due to heat?",
                "Which medicine to take if I get Exhausted?",
                "How to cure Heat Exhaustion?"
            ],
            "responses": [
                "First call your local emergency number. Then move the person out of the heat right away. Cool the person by whatever means available. For example: \n\n1) Put the person in a cool tub of water or a cool shower. \n\n2) Spray the person with a garden hose. \n\n3) Sponge the person with cool water. \n\n4) Fan the person while misting with cool water. \n\n5) Place ice packs or cool wet towels on the neck, armpits and groin. \n\n6) Cover the person with cool damp sheets. \n\n7) If the person is conscious, offer chilled water, a sports drink containing electrolytes or other nonalcoholic beverage without caffeine"
            ]
        },
        {
            "tag": "heatstroke",
            "patterns": [
                "How do you treat Heat Stroke?",
                "what to do if i get a Heat Stroke?",
                "Which medicine to take if I get Stroke?",
                "How to cure a Heat Stroke?"
            ],
            "responses": [
                " "
            ],
            "context_set": "To reduce the patient's temperature as quickly and safely as possible, the physician may use different cooling techniques that involve immersion, evaporation, or invasive means. \n\nMedication may be given to control shivering, and urine output will be monitored. The patient's temperature will be monitored for days, as a person who has experienced heatstroke may have an unstable temperature for quite some time."
        },
        {
            "tag": "insectbites",
            "patterns": [
                "How do you treat a Insect Bite?",
                "what to do if a insect bites me?",
                "Which medicine to take if I get bitten by a insect?",
                "How to cure insect bite?"
            ],
            "responses": [
                "To treat an insect bite or sting: \n\n1) Remove the sting, tick or hairs if still in the skin.Wash the affected area with soap and water. \n\n2) Apply a cold compress (such as a flannel or cloth cooled with cold water) or an ice pack to any swelling for at least 10 minutes. \n\n3) Raise or elevate the affected area if possible, as this can help reduce swelling. \n\n4) Avoid scratching the area or bursting any blisters, to reduce the risk of infection - if your child has been bitten or stung, it may help to keep their fingernails short and clean. \n\n5) Avoid traditional home remedies, such as vinegar and bicarbonate of soda, as they're unlikely to help. \n\n6) The pain, swelling and itchiness can sometimes last a few days."
            ]
        },
        {
            "tag": "nosebleed",
            "patterns": [
                "How do you treat a bleeding nose?",
                "what to do if i my nose is bleeding?",
                "Which medicine to take if I get nose bleed?",
                "How to cure nose bleeding?"
            ],
            "responses": [
                "Use your thumb and index finger to pinch your nostrils shut. Breathe through your mouth. Continue to pinch for 10 to 15 minutes. \n\nPinching sends pressure to the bleeding point on the nasal septum and often stops the flow of blood"
            ]
        },
        {
            "tag": "pulledmuscle",
            "patterns": [
                "How do you treat a Pulled Muscle?",
                "what to do if my muscle is pulled?",
                "Which medicine to take if I got pulled muscle?",
                "How to cure a pulled muscle?"
            ],
            "responses": [
                "Use an ice pack or slush bath of ice and water for 15 to 20 minutes each time and repeat every two to three hours while you're awake for the first few days after the injury. \n\nCompression. To help stop swelling, compress the area with an elastic bandage until the swelling stops."
            ]
        },        
        {
            "tag": "sunburn",
            "patterns": [
                "How do you treat Sun Burn?",
                "what to do if i get a Sun Burn?",
                "Which medicine to take if I get Sun Burn?",
                "How to cure a Sun Burn?"
            ],
            "responses": [
                "1) Apply aloe or over-the-counter moisturizing lotion to skin as directed. \n\n2)Take a cool bath or shower to cool skin. \n\n3) Apply cool compresses to soothe skin. \n\n4) Take acetaminophen (Tylenol) or ibuprofen (Advil, Motrin, Nuprin) for pain. \n\n5) Leave blisters alone. Don't break them. \n\n6) Protect your skin from further sun exposure."
            ]
        },        
        {
            "tag": "vertigo",
            "patterns": [
                "How do you treat a Vertigo?",
                "what to do if i get a Vertigo?",
                "Which medicine to take if I get Vertigo?",
                "How to cure a Vertigo?"
            ],
            "responses": [
                "1) The person should sit down or lie still. \n\n2) If the person gets light-headed when standing up, the person should stand up slowly. \n\n3) Avoid sudden changes in position. \n\n4) If the person is thirsty, have them drink fluids. \n\n5) Avoid bright lights."
            ]
        },
        {
            "tag": "normalbleeding",
            "patterns": [
                "How do you treat bleeding?",
                "what to do if i get a Bleeding?",
                "Which medicine to take if I get bleeding?",
                "How to cure Bleeding?"
            ],
            "responses": [
                "Place a sterile bandage or clean cloth on the wound. \n\nPress the bandage firmly with your palm to control bleeding. \n\nApply constant pressure until the bleeding stops. \n\nMaintain pressure by binding the wound with a thick bandage or a piece of clean cloth. \n\nDon't put direct pressure on an eye injury or embedded object. \n\nSecure the bandage with adhesive tape or continue to maintain pressure with your hands. \n\nIf possible, raise an injured limb above the level of the heart."
            ]
        },
        {
            "tag": "eyeinjury",
            "patterns": [
                "How do you treat an eye Injury?",
                "what to do if i get a eye Injury?",
                "Which medicine to take if I injured my eye?",
                "How to cure injured eye?"
            ],
            "responses": [
                "Cover the injured eye with a clean eye pad or wound dressing. \n\nIf there is a large foreign body lodged in the eye, DO NOT attempt to remove it, but pad around the eye socket to avoid pressure. \n\nAdvise the patient to keep the uninjured eye closed if possible, to reduce the risk of movement of the injured eye. Seek immediate medical assistant."
            ]
        },
        {
            "tag": "chemicalburn",
            "patterns": [
                "How do you treat a chemical burn?",
                "what to do if i get a Chemical Burn?",
                "Which medicine to take if I get burn due to chemicals?",
                "How to cure Chemical Burn?"
            ],
            "responses": [
                "If you think you have a chemical burn, take these steps immediately: \n\n1) Remove dry chemicals. Put on gloves and brush off any remaining material. \n\n2) Remove contaminated clothing or jewelry and rinse chemicals off for at least 20 minutes, in a shower if it's available. Protect your eyes from chemical contamination. \n\n3) Bandage the burn. Cover the burn with a clean bandage. Wrap it loosely to avoid putting pressure on burned skin. \n\n4) Rinse again if needed. If you feel more burning, rinse the area again for several more minutes."
            ]
        },
        {
            "tag": "poison",
            "patterns": [
                "How do you treat a Poison?",
                "what to do if i get Poison?",
                "Which medicine to take if I am poisoned?",
                "How to cure Poisoning?"
            ],
            "responses": [
                "Take the following actions until help arrives: 1) Swallowed poison. Remove anything remaining in the person's mouth. If the suspected poison is a household cleaner or other chemical, read the container's label and follow instructions for accidental poisoning. \n\n2) Poison on the skin. Remove any contaminated clothing using gloves. Rinse the skin for 15 to 20 minutes in a shower or with a hose. \n\n3) Poison in the eye. Gently flush the eye with cool or lukewarm water for 20 minutes or until help arrives. \n\n4) Inhaled poison. Get the person into fresh air as soon as possible. \n\n5) If the person vomits, turn his or her head to the side to prevent choking. \n\n6) Begin CPR if the person shows no signs of life, such as moving, breathing or coughing. \n\n7) Call Poison Help at your regional poison control for additional instructions. \n\n8) Have somebody gather pill bottles, packages or containers with labels, and any other information about the poison to send along with the ambulance team"
            ]
        },
        {
            "tag": "teeth",
            "patterns": [
                "How do you treat broken Teeth ?",
                "what to do if my Teeth got broken?",
                "Which medicine to take if I get broken teeth?",
                "cure broken teeth?"
            ],
            "responses": [
                "If you do suffer from a tooth chip or breakage it's important to book an appointment to see your dentist immediately. \n\nApply a cold pack to the cheek or lips around the damaged area - this will reduce swelling and provide pain relief. \n\nYou can also take ibuprofen or paracetamol to help with any pain."
            ]
        },
        {
            "tag": "seizure",
            "patterns": [
                "How do you treat a seizure?",
                "what to do if i get a seizure?",
                "Which medicine to take if I get seizure?",
                "How to cure seizure?"
            ],
            "responses": [
                "Place something soft under their head and loosen any tight clothing. Reassure the person until they recover. \n\nTime the seizure, if you can. Gently roll the person onto their side after the jerking stops."
            ]
        },
        {
            "tag": "headinjury",
            "patterns": [
                "How do you treat a head Injury?",
                "what to do if i get a Head Injury?",
                "Which medicine to take if I get injured in the head?",
                "How to cure Head Injury?"
            ],
            "responses": [
                "Apply firm pressure to the wound with sterile gauze or a clean cloth. But don't apply direct pressure to the wound if you suspect a skull fracture. \n\nWatch for changes in breathing and alertness. If the person shows no signs of circulation — no breathing, coughing or movement — begin CPR"
            ]
        },
        {
            "tag": "fainting",
            "patterns": [
                "How do you treat Faint?",
                "what to do if i feel like Fainting?",
                "Which medicine to take if I get a Faint?",
                "How to cure Fainting?"
            ],
            "responses": [
                "If there are no injuries and the person is breathing, raise the person's legs above heart level — about 12 inches (30 centimeters) — if possible. Loosen belts, collars or other constrictive clothing. \n\nTo reduce the chance of fainting again, don't get the person up too quickly."
            ]
        },
        {
            "tag": "headache",
            "patterns": [
                "How do you treat a mild Headache?",
                "what to do if i get a mild Headache?",
                "Which medicine to take if I have a mild headache?",
                "How to cure a mild headache?"
            ],
            "responses": [
                "Give ibuprofen (Advil, Motrin), aspirin, or acetaminophen (Tylenol) for pain. \n\nAvoid ibuprofen and other NSAIDs if the person has heart failure or kidney failure. \n\nDo not give aspirin to a child under age 18."
            ]
        },
        {
            "tag": "test",
            "patterns": [
                "what is test"
            ],
            "responses": [
                "This is a test"
            ]
        },
        {
            "tag": "cold",
            "patterns": [
                "How do you treat a Cold?",
                "what to do if i get a mild Cold?",
                "Which medicine to take if I have a Cold?",
                "How to cure Cold?"
            ],
            "responses": [
                "1) Keeping hydrated is absolutely vital to help 'flush' out the cold, as well as to break down congestion and keep your throat lubricated. \n\n2) Vitamin C is extremely helpful when fighting infection, so at the first sign of a cold be sure to increase your intake by eating plenty of berries, citrus fruits, papayas, broccoli and red peppers which will help keep you protected. \n\n3) When it comes to combating a cold,Vitamin D is essential in helping to regulate immune response."
            ]
        },
        {
            "tag": "rash",
            "patterns": [
                "How do you treat Rashes?",
                "what to do if i get a Rash?",
                "Which medicine to take if I have a Rash?",
                "How to cure Rash?"
            ],
            "responses": [
                "1) Olive oil helps in healing and promotes skin renewal given it is packed with vitamin E and antioxidants. It also soothes the skin and reduces itching. \n\n2) Baking soda is useful in drying skin rashes as also in relieving itching and inflammation. \n\n3) Aloe Vera,Thanks to its antibacterial, antifungal, anti-inflammatory and emollient properties, aloe vera is excellent for treating a number of skin ailments including rashes as also soothing the skin."
            ]
        },
        {
            "tag": "snakebite",
            "patterns": [
                "How do you treat a snake bite?",
                "what to do if i get a snake bite?",
                "Which medicine to take if I get a snake bite?",
                "How to cure snake bite?",
                "i got bit by a snake"
            ],
            "responses": [
                "While waiting for medical help: \n\n1) Move the person beyond striking distance of the snake. \n\n2) Have the person lie down with wound below the heart. \n\n3) Keep the person calm and at rest, remaining as still as possible to keep venom from spreading. \n\n4) Cover the wound with loose, sterile bandage. \n\n5) Remove any jewelry from the area that was bitten. \n\n6) Remove shoes if the leg or foot was bitten."
            ]
        },
        {
            "tag": "animalbite",
            "patterns": [
                "How do you treat a animal bite?",
                "How do you treat a monkey bite?",
                "How do you treat a dog bite?",
                "what to do if i get a animal bite?",
                "Which medicine to take if I get a monkey bite?",
                "How to cure dog bite?",
                "i got bit by a dog"
            ],
            "responses": [
                "1) Wash the wound with soap and warm water. \n\n2) Gently press a clean cloth over the wound to stop the flow of blood. \n\n3) Apply an antibacterial ointment to the wound. \n\n4) Cover with a sterile bandage. \n\n5) Watch for signs of infection. \n\n6) Seek help if you suspect infection or possible exposure to rabies, or if the wound is severe."
            ]
        },
        {
            "tag": "drowning",
            "patterns": [
                "What to do if someone is Drowning?",
                "what to do if someone drowned?",
                "What steps to take if i see a drowning person?",
                "How to help a drowning person?"
            ],
            "responses": [
                "1) Place your ear next to the person's mouth and nose. Do you feel air on your cheek? \n\n2) Look to see if the person's chest is moving.If the Person is Not Breathing, Check Pulse. \n\n3) Check the person's pulse for 10 seconds.If There is No Pulse, Start CPR."
            ]
        },
        {
            "tag": "cpr",
            "patterns": [
                "How to give CPR??",
                "what to do in a CPR?",
                "What steps to take in a CPR??",
                "How to help a drowning person in CPR?"
            ],
            "responses": [
                "1) For an adult or child, place the heel of one hand on the center of the chest at the nipple line. You can also push with one hand on top of the other. For an infant, place two fingers on the breastbone. \n\n2) For an adult or child, press down at least 2 inches. Make sure not to press on ribs. For an infant, press down about 1 and 1/2 inches. Make sure not to press on the end of the breastbone. \n\n3) Do chest compressions only, at the rate of 100-120 per minute or more. Let the chest rise completely between pushes. 4)Check to see if the person has started breathing."
            ]
        },
        {
            "tag": "fracture",
            "patterns": [
                "How do you treat a Fracture?",
                "what to do if i get a Fracture?",
                "Which medicine to take if I have a Fracture?",
                "How to cure a Fracture?"
            ],
            "responses": [
                "1) Stop any bleeding. Apply pressure to the wound with a sterile bandage, a clean cloth or a clean piece of clothing. \n\n2) Immobilize the injured area. Don't try to realign the bone or push a bone that's sticking out back in. If you've been trained in how to splint and professional help isn't readily available, apply a splint to the area above and below the fracture sites. Padding the splints can help reduce discomfort. \n\n3) Apply ice packs to limit swelling and help relieve pain. Don't apply ice directly to the skin. Wrap the ice in a towel, piece of cloth or some other material. \n\n4) Treat for shock. If the person feels faint or is breathing in short, rapid breaths, lay the person down with the head slightly lower than the trunk and, if possible, elevate the legs."
            ]
        }
    ]
}